app/Controllers/Auth/AuthController.php

    public function registerStep1()
    {
        if (session()->get('is_logged_in')) {
            return redirect()->to(session()->get('is_admin') ? '/admin/dashboard' : '/mon-espace');
        }

        $genreModel = new Genre();
        $data['genres'] = $genreModel->findAll();
---
SELECT *
FROM `ref_genres`

    public function registerStep2()
    {
        if (session()->get('is_logged_in')) {
            return redirect()->to(session()->get('is_admin') ? '/admin/dashboard' : '/mon-espace');
        }

        // Vérifier que l'étape 1 est complétée
        if (!session()->getTempdata('register_step1')) {
            return redirect()->to(url_to('register.step1'))
                ->with('error', 'Veuillez d\'abord compléter l\'étape 1');
        }

        $objectifModel = new Objectif();
        $data['objectifs'] = $objectifModel->findAll();
---
SELECT *
FROM `ref_objectifs`