app/Controllers/Utilisateurs/FrontController.php

SELECT *
FROM `utilisateurs`
WHERE `utilisateurs`.`id` = 1000
SELECT *
FROM `ref_objectifs`
SELECT *
FROM `portefeuilles`
WHERE `utilisateur_id` = 1000
 LIMIT 1
---
    public function myDashboard()
    {
        $userId = session()->get('user_id') ?? 1;

        $userModel = new Utilisateur();
        $profilModel = new ProfilSante();
        $objectifModel = new Objectif();
        $portefeuilleModel = new Portefeuille();

        $user = $userModel->find($userId);
        $profil = $profilModel->where('utilisateur_id', $userId)->first();
        $objectifs = $objectifModel->findAll();
        $portefeuille = $portefeuilleModel->where('utilisateur_id', $userId)->first();

SELECT *
FROM `portefeuilles`
WHERE `utilisateur_id` = 1000
 LIMIT 1
---
    public function souscrireGold()
    {
        $userId = session()->get('user_id') ?? 1;
        $prixGold = 50000; // Par exemple 50 000 Ar / mois

        $portefeuilleModel = new Portefeuille();
        $portefeuille = $portefeuilleModel->where('utilisateur_id', $userId)->first();

SELECT *
FROM `regimes`
WHERE `regimes`.`id` = '3'
SELECT `activites_sportives`.*
FROM `activites_sportives`
INNER JOIN `objectif_activites` ON `objectif_activites`.`activite_id` = `activites_sportives`.`id`
WHERE `activites_sportives`.`is_actif` = 1
AND `objectif_activites`.`objectif_id` = '1'
---
    private function getSuggestion($objectif_id, $imc, $poidsActuel)
    {
        $regimeModel = new Regime();
        $tarifRegimeModel = new TarifRegime();
        $activiteModel = new Activite();

        $direction = ($objectif_id == 1) ? -1 : (($objectif_id == 2) ? 1 : 0);

        if ($direction == 0) {
            $regimes = $regimeModel->where('is_actif', 1)->findAll();
            $bestRegime = !empty($regimes) ? $regimes[0] : null;
        } else {
            $operator = ($direction > 0) ? '>' : '<';
            $tarifs = $tarifRegimeModel->where("variation_poids_kg $operator", 0)
                                       ->orderBy("ABS(variation_poids_kg)", 'DESC')
                                       ->findAll();

            if (empty($tarifs)) {
                $bestRegime = null;
            } else {
                $bestTarif = $tarifs[0];
                $bestRegime = $regimeModel->find($bestTarif['regime_id']);
                $bestRegime['best_tarif'] = $bestTarif;
            }
        }

        if (!$bestRegime) return [];

        $activites = $activiteModel->select('activites_sportives.*')
                                   ->join('objectif_activites', 'objectif_activites.activite_id = activites_sportives.id', 'inner')
                                   ->where('activites_sportives.is_actif', 1)
                                   ->where('objectif_activites.objectif_id', $objectif_id)
                                   ->findAll();